{"id": "2", "text": "Comment:I swear they know it's killing us. They just want to horde all of the wealth and resources before everything turns to shit,Reply:They're counting on the next administration fixing their shit. While they sit back and enjoy their hoard. I'd call them dinosaurs, but dragons is more apt. since they prefer to hoard and play with lives like toys.", "label": "2"}
{"id": "2", "text": "Comment:I'm disappointed that there are still deniers when Australian GOVERNMENT websites preach about the science... it's like the people behind the scenes are happy to put the truth on the gov websites, but then the denier politicians get the TV air time and say the opposite. Ppl need to stop listening to unqualified pollies, who say whatever they need to further their own interests... and 'listen to the scientists!' (yep... that's Greta),Reply:And then they say they are listening to science while denying it! But yeah that's why I like this, it's just factual information that shows what's happening to the climate in Australia very clearly, no denying the trend, no claiming it was a one off \"hot year\", just the facts.", "label": "2"}
{"id": "2", "text": "Comment:What's the deal with Sweden? I thought they were supposed to be progressive. Are there just hordes of inbred Scandinavian hillbillies flying under the radar there?,Reply:I was surprised to see that too. I think they are deluded by recycling and thinking everything can be solved by recycling. It could be something with northern white nations. Norway, Canada, and Finland all are high up on the list.", "label": "2"}
{"id": "2", "text": "Comment:Nuclear energy is clean energy. Why do Americans oppose it so much?,Reply:America has a history of just storing nuclear waste indefinitely. Many Americans I know who are opposed to nuclear energy aren't even aware that the technology exists to reprocess spent fuel. Yes, it's expensive, but it's zero-carbon, and assuming they use modern safety procedures, is very safe. France has been reprocessing fuel for decades, and they don't have the same problem as us trying to figure out what to do with our spent fuel.", "label": "2"}
{"id": "2", "text": "Comment:Don't take anything posted on arctic-news seriously. That place is full of some of the most alarmist bullshit ever, even when compared with other doomers.,Reply:no kidding. reddit is a pretty bad place to search for information nowadays in general", "label": "2"}
{"id": "2", "text": "Comment:I'm right behind you! When I saw that ad with Greg James in it my heart sunk. I don't believe that cancel culture is fair but I'd like to at least shame those influencers who take money from oil and gas companies. This is green washing at its finest and I'm gutted Greg James fell for it,Reply:Absolutely! I've commented on his videos on YouTube saying how disappointed I am he's sold out, not like he needs the money.", "label": "2"}
{"id": "2", "text": "Comment:Bad study. Chemistry, Physics and Biology textbooks shouldn't be devoting that much space to climate change. 4% or about 600 pages of 15,000 pages between 16 books seems reasonable. That's about 35 or 40 pages a book or almost a whole fucking chapter in what are books that only touch around the edges of the subject.,Reply:Yeah . I don't know what the hell they think that is supposed to indicate?? Why would my physiology class talk about climate change?", "label": "2"}
{"id": "2", "text": "Comment:Does anyone think we need a more foreceful plan than waiting for people in charge to fix shit? We are going to the verge, and we need to change soon or else,Reply:Or maybe the ship has already struck the iceberg. Honestly it's very hard to see any sort of rescuing the planet at this juncture without unimaginable changes in human civilization. As in countries ditch their militaries and spend that money on renewables and carbon capture.", "label": "2"}
{"id": "2", "text": "Comment:If you are talking about global climate armageddon it doesn't matter how climate resilient the place you have chosen to set up your idyllic existence is, because you are about to be over run by a mass migration of starving and desperate climate refugees. Better off learning self defense and survival skills. Sorry.,Reply:Yeah, I was going to suggest getting away from other people. Humans are the worst.", "label": "2"}
{"id": "2", "text": "Comment:Let's not give either of them more credit than is due. I know less about Clinton's policy, but Obama had ample scientific evidence, plenty of opportunity (especially in his first two years) to enact clean-energy policies, and did next to nothing. Don't forget that keystone happened under his watch.,Reply:The economic stimulus under Obama could've been a declared WWIII against greenhouse gases, complete with rallying the nation in community spirit in a crisis. Instead, he saved the banks and largely ignored the biggest crisis facing not just the economy, but all of humankind and its descendants. Where was he when we needed him? Why didn't Hillary mention it in the debates? They're waving this flag a bit too late.", "label": "2"}
{"id": "2", "text": "Comment:I think a better question to ask if why people who know that climate change is real still do things that contribute to it, and then pass judgement on people that don't believe it.,Reply:That only shows the wickedness of the problem, even the people that know climate change is real can't stop making the problem worse. Cowards see that paradox and immidiatly give up. Others face it and are working to find solutions.", "label": "2"}
{"id": "2", "text": "Comment:Reavey argued that fossil fuel firms, particularly coal, should emulate the tactics of big tobacco, which similarly spent decades battling scientists and regulators over claims that its product harmed public health Reavey told the paper that his firm \"has never fought climate change -- never fought it, never denied it or funded anyone who does.\" The bankruptcy filing from last week, however, suggests otherwise. Lying piece of garbage,Reply:I'm also ready to bet they went bankrupt just in time to avoid paying for cleaning up the industrial sites they left behind.", "label": "2"}
{"id": "2", "text": "Comment:Sub to /r/ClimateActionPlan Trivial I know but starting to become aware of the daily brights spots really do help. You're one person staring into a problem of unfathomable size but you are not alone. The world is full of smart people doing good work on this just like you and they all matter greatly to folks like me. This is gonna be th decade of change. We have to and we will!,Reply:Thank you, you're right! There is lots of good to be found, I just get tunnel vision and forget to look sometimes. Good reminder.", "label": "2"}
{"id": "2", "text": "Comment:\"Death spiral\" is unnecessary sensationalist and not that well founded in the article. Can we have a middle ground between \"totally ignoring it\" and doomsday preaching?,Reply:I'm what many would call a climate alarmist, and I have been for many years. You are correct. We need to be 'cool'-headed and objective in our approach and language, more now than ever.", "label": "2"}
{"id": "2", "text": "Comment:Yeah but then NASA lost their technology. We are stuck in low Earth orbit until we invent it again.,Reply:They also lost the designs of their magic spacesuits that can withstand both +250F and -250F temps. Also, lost the original footage. Oh yeah, also lost the telemetry data. And a huge amount of the moon rocks. Also lost the plans to the Saturn V rocket.", "label": "2"}
{"id": "2", "text": "Comment:You can't convince people who don't want to know, or think they are right in their denial.,Reply:Yes I fear that is the main issue. It is the same with both Brexit and Donald Trump.", "label": "2"}
{"id": "2", "text": "Comment:What are you talking about, no movement? You know last September there were like 400,000 people marching through Manhattan? There are fossil fuel divestment campaigns all over the country and world, chapters of 350.org all over, plenty of other major movement org and local fights against fossil fuels everywhere. But yeah leaders-wise, you have like Bill McKibben, Naomi Klein and other figures, but most movements these days aren't centered around major figureheads. So there is a movement but it needs wider involvement. Like this should be important to everyone.,Reply:alright touche good answer, better than all the rest of the preachy doomsday shite posted by everyone else in this thread. 400k people though I mean they could have laid the city low if they wanted, couldn't they have done something more than march?", "label": "2"}
{"id": "2", "text": "Comment:#NAME?,Reply:I'm assuming she thinks her and her kids are privileged enough to dodge it. Or she's a denier. Idk.", "label": "2"}
{"id": "2", "text": "Comment:Harris, Buttigieg, O'Rourke, and Biden are named as taking campaign contributions from people who made their millions off fossil fuels,Reply:Yeah. There us a big difference in how they raise money, as compared with Sanders and Warren, who dont do $2800/person events on their own behalf", "label": "2"}
{"id": "2", "text": "Comment:People are all panicked about Trump, but this is the guy I've always thought was the bigger threat. He agrees with most of the things that Trump says, and where he doesn't, he's more conservative.,Reply:> People are all panicked about Trump, but this is the guy I've always thought was the bigger threat. Agreed.", "label": "2"}
{"id": "2", "text": "Comment:I don't know the article but I've hated this guy's takes for a while. Drove me nuts when I saw fellow climate scientists sharing his \"why climate alarmism is bad\" article a while back.,Reply:Yeah, he positively reeks of being a front man for climate change skepticism. Every time the climate deniers get proven wrong, they retreat a bit and take a slightly softer stance. First it was \"climate change is a LIE\" and then it was disproven. Then it was \"climate change is real but not manmade\" and then that was disproven. Finally we have \"climate change is real and manmade, but not as bad as the scientists say.\" And frankly we know that's false too, and are in the process of showing just how very wrong it is.", "label": "2"}
{"id": "2", "text": "Comment:While I'm all for reducing emissions, I can see why the Court ruled the way it did. Trying to impose a cap on distributors based on customer use of the product would be hard to justify. It's like fining the fuel truck companies that fill gas stations for the CO2 emissions that individuals produce when they buy the gas from the gas stations.,Reply:Agreed. It is only hard to justify in a system where profits go to owners and costs go to society at large. Accountability for the consequences of pollution has long been thrust on consumers rather than been seen as a cost of dong business. Most attempts to bring any amount of regulation to the process is by definition, currently inadmissible in GOP circles so there goes the largest potential down the drain. It's a system set up to fail.", "label": "2"}
{"id": "2", "text": "Comment:I'm not a climate scientist, but throwing out a logical possibility. Summer temps are always around 0 because there is still ice around, any increase in heat content leads to melting of more ice. Winter is when the warm water from the summer melt shows up and this is noticeable because winter temps can go way past 0.,Reply:Yeah, that is along the lines of what I am thinking.", "label": "2"}
{"id": "2", "text": "Comment:It's imature, self-centered and narrow-minded to have kids without properly contemplating the likely climate consequences for the remainder of the century. That is more nuanced than a simple yes/no to reproduction.,Reply:Totally correct. That's why we're trying to figure out what to do.", "label": "2"}
{"id": "2", "text": "Comment:I wonder if they'd feel the same way if they paid taxes. I should sue the Government for being partial in who pays taxes, after all, doesn't the man made climate change affect everyone?,Reply:Yeah. It's totally unfair that the rich are paying less taxes percentage wise. Good idea. I'll start a class action lawsuit with my peers at college", "label": "2"}
{"id": "2", "text": "Comment:Wow, Im glad some elected state officials have finally gotten over what we all should have gotten over 40 years ago in 1989, now can we please get on with the Green New Deal WW2 style transition to renewable energy? I need news that actually assuages my climate depression and doesn't just put a fake smile on my face.,Reply:I feel the same :( we really need to move forward fast", "label": "2"}
{"id": "2", "text": "Comment:Wut? Even with a massive 5%/yr increase in renewable energy (2016-2080) we cannot avoid dangerous warming. Every projection requires the rollout of large scale CCS projects.,Reply:Yeah, this is a ridiculous premise. The word is mitigate, not about.", "label": "2"}
{"id": "2", "text": "Comment:If we extend your logic to call out any human activity that has a negative impact on the environment, then who can call themselves an environmentalist?,Reply:I agree. But also, some things have a much greater impact on environmental issues than others.", "label": "2"}
{"id": "2", "text": "Comment:2 Reasons: -Money is being spent to keep it out of the discussion -Human are not good at being proactive on gradual (10+) crisis's,Reply:3rd reason: Most of the damage of climate change will happen in third world countries (especially Africa), and there is absolutely no way that people in third world countries will get their voices heard in first-world media.", "label": "2"}
{"id": "2", "text": "Comment:I still can't quite believe that we are living in a world in which the President of the United States mocks a 16 year old girl because she won an award that he wanted.,Reply:Wow, I agree. It's kinda funny that a president of the freaking United States is complaining about a gen Z winning a award that he is convinced that he should win. Wow that's very entitled XD", "label": "2"}
{"id": "2", "text": "Comment:I don't understand why China committed to capping CO2 by 2030 if they seem to have already capped it. This is over a year of emission reduction. That makes the peak early 2014, not 2030.,Reply:Yes, this news is very surprising and something weird seems to be happening. It's almost too good to be true. I mean I hope it is true, but maybe its some kind of anomaly that they do not expect to continue.", "label": "2"}
{"id": "2", "text": "Comment:Yet the Keeling curve continues to rise, at a record rate actually.,Reply:yep. The planet is so warm that is emitting more carbon than what we emit. It will probably reinforce itself until all easily accessible carbon is emitted or the solar forcings are low enough. Whatever comes first. Climate change deniers got their wish. Human CO2 emissions are now insignificant. Well not really insignificant yet, but at some point soon they will be.", "label": "2"}
{"id": "2", "text": "Comment:This is a pretty generous estimate with most of the artic ice cap and great barrier reef gone. Droughts and the collapse of the food chain is going to be a problem and there might not be enough for 1billion.,Reply:Yeah. I think the vast majority of people will be forced to move under worst case BAU assumptions.", "label": "2"}
{"id": "2", "text": "Comment:>Do you think feel that climate change is talked about enough in the media/on social media? This has an agree/disagree slider, but I feel it's a little ambiguous since it's a question, not a statement.,Reply:Yea, looking back at it, I agree with you. I think in my head, the degrees on the scale were meant to represent whether it should also be talked about an increased/lesser amount in addition to a straight yes/no answer, but the questionable wording of the question escaped my notice unfortunately!", "label": "2"}
{"id": "2", "text": "Comment:Every iota energy spent on 'debating' known facts is wasted. We should argue about the best solution.,Reply:I agree but unfortunately a lot of people dont feel that way. like the guy i lovefishandchips", "label": "2"}
{"id": "2", "text": "Comment:When it happens I'm pretty sure these dumbfucks will totally deny it or pull some bullshit stat from their asses and turn it around saying that they were the ones supporting climate claim changes throughout. They've always done it and it's always deny deny until its forgotten for these jackasses.,Reply:Conservatives are \"low effort thinkers\". You are absolutely correct. When the shit hits the fan and humanity goes extinct in 2030, the Conservatives will remember this as being the environmentalists' fault. Notice: Conseravatives NEVER think anything through. Their every move comes in reaction to surface events.", "label": "2"}
{"id": "2", "text": "Comment:Great decisions - if you can transition to a completely vegan diet your personal contribution would be even better. Additionally, it has compounding effects by influencing the community around you. Make a commitment not to fly more than once per year.,Reply:Honestly I was surprised how much of a shift I was happy with diet wise once I was truly motivated. I have always been a \"meat\" guy. We have only been at it a few weeks and I am sure we will continue to shift farther down the spectrum as time goes on. We have 30 acres and our own flock of chickens so that gives us even more wiggle room!", "label": "2"}
{"id": "2", "text": "Comment:What the hell has happened to Australia? I thought they were modern, progressive and aware. Maybe I was wrong..?,Reply:Yes, it is a very reactionary (for the 1st world) country, with governments that are consistently climate denialists and often in the pockets of the coal mining industry.", "label": "2"}
{"id": "2", "text": "Comment:Building a wall seems to be his solution in 9/10 cases,Reply:That's the breadth of his knowledge. Just build a wall and it'll all be ok. I wonder if he'll build a wall for snow storms or hurricanes caused by climate change.", "label": "2"}
{"id": "2", "text": "Comment:Good luck! Gah, coal is 100 steps in the opposite dimension.,Reply:Yep...So far 14 cities in Japan have declared climate emergency, but 22 coal plants are due to come into action in the next few years, lets fight this!! Thank you so much for taking the time to sign.", "label": "2"}
{"id": "2", "text": "Comment:About 1970 it became profitable for large polluters to push a science denial attitude among a political faction so corporations have paid to do that. Now we have two or three generations of people in some areas that think science=evil unless it involves weapons production. Too bad for them understanding science will save their lives.,Reply:Add the fact that also we need to worry about certain type of Sciences \"backing up\" with \"evidence\" what corpobabies will need in the future. Including green energy.", "label": "2"}
{"id": "2", "text": "Comment:Jesus, it's like, you know what's coming, but seeing it unfold in real time is no bueno.,Reply:I keep deep sighing at every climate related news that surfaces. No bueno indeed.", "label": "2"}
{"id": "2", "text": "Comment:Not sure this is true. China, Europe, Japan, South Korea, etc. are already making big moves. A Trump victory will be a disaster, but one which can be dealt with. I think the US population is not ready to acknowledge the scale of American decline. The US will be a junior partner in whatever solution is hashed out between the political classes of Asia and Europe.,Reply:It's embarrassing for sure. We are unfit to lead anything and I do hope the world makes us take a seat and fix our own house first.", "label": "2"}
{"id": "2", "text": "Comment:I think this is cool, but I can already imagine some real-estate developer complaining about something, how it's not artistically pleasing, etc.,Reply:more so how he is going to go default on his loans because the equipment needed to get within compliance of Local Law 97 is not cheap.", "label": "2"}
{"id": "2", "text": "Comment:This sub is full of garbage articles with political undertones tbh. Climate has become a popular subject, so all the blog writers are trying to get a chunk of that demand. The result is tons of low quality articles. Moreover, I don't care about the latest update on ice sheets and what not. I already know they're melting. I've come to think carbon sequestration is the ultimate solution.,Reply:The IPCC agrees with you, unfortunately. I'm hopeful that it will work, but we're basically betting the future of the entire planet on sequestration working on a ludicrous scale.", "label": "2"}
{"id": "2", "text": "Comment:Combined cycle gas turbine generation has been at 60+% for more than a decade, and most new generation is in this class. The GE 9HA is an incremental improvement.,Reply:> Combined cycle gas turbine generation has been at 60+% for more than a decade, and most new generation is in this class. The GE 9HA is an incremental improvement. And seen some claims about 80% efficiency with waste-heat recovery systems in multi-fuel plants. Still worth attention in a wider audience due to how big of an impact a few percent has, one of these things can power a city -- add an entire neighbourhood or industrial area with no increased carbon emissions.", "label": "2"}
{"id": "2", "text": "Comment:Attempting to link climate science denials with racism is a perfect example of politicizing the issue, which is exactly what those who deny the science say is happening. This really does a disservice to the credibility of climate research.,Reply:The other side happily politicizes it and we should not be unaware of how they convince their voters.", "label": "2"}
{"id": "2", "text": "Comment:She mentions thousands of years of built up wisdom that western civilization lacks. Is there a way to learn some of what she and her kin have to teach?,Reply:I too would like to learn some of this wisdom that they have gained over the millenia", "label": "2"}
{"id": "2", "text": "Comment:You could also try /climatechange (you'll get conversations about earth system sensitivity and definitions of lukewarmers) or /energy. Really, you should ask why people don't believe in *anthropogenic* climate change. The denial train has moved away from \"there is no climate change\" to \"climate change has always happened and humans don't have a significant impact\". Maybe if you try in askreddit (wide exposure) or some of the Donald Trump subs you'll get \"Chinese hoax\" stuff?,Reply:Great! I will try asking in the askreddit section with your suggestion. Thank you :).", "label": "2"}
{"id": "2", "text": "Comment:#NAME?,Reply:It may feel better, but it's ultimately futile. We are out of time.", "label": "2"}
