{"id": "1", "text": "Comment:Actions matter.. Do you slap your partner across the face and then say we need to reduce domestic violence ? Reduce your personal footprint to the 2t per annum needed (don't just swap the F150 for a large sedan, ditch it and buy a bike), encourage friends and peers to do, likewise and most importantly, only vote for politicians who will drag freeriders along via legislation. Do that and you know you have done all you can as an individual.,Reply:How is 2 t / year derived? How close are you to that?", "label": "1"}
{"id": "1", "text": "Comment:But back in the day, all politicians agreed that the moon existed and was no Chinese hoax.,Reply:Some people in power are already taking action. Besides, there won't be denying the sudden influx of climate refugees.", "label": "1"}
{"id": "1", "text": "Comment:I did three years ago. It's been hard but worth it,Reply:I'm a sophomore in college trying to decide my major, could you share with me why you think so?", "label": "1"}
{"id": "1", "text": "Comment:Climate has always tried to kill us. We build houses to protect us from deadly weather. We wear clothing and shoes to protect us from multiple environmental factors, ranging from insects to disease. Most of Florida used to be uninhabitable before we drained half the state. About a quarter of all of San Francisco would be underwater were it not for the manmade landfills. Climate is our enemy but we have always adapted. But doing so in the future will require increasingly sophisticated methods for adaptation, which means encouraging economic growth, not restricting it through Green policies.,Reply:I think a lot of people imagine dealing with the 21st-century climate by relying on 19th-century adaptation methods -- a task which understandably seems quite daunting. Not many people in this category bother to educate themselves about how actual climate-adaptation efforts work. Admittedly, it's a very diffuse topic -- the many facets of hydrology, for instance, are tough to get a handle on. I also suspect most people don't know about recent leaps in agricultural technology like the Green Revolution.", "label": "1"}
{"id": "1", "text": "Comment:Only the what?...500th politician to say that? Actions are what matter. I'll cheer on anyone who actually brings change. Talk is cheap as ball hair,Reply:The threshold for legislation in the US is a 60% supermajority in the Senate. That makes it really hard to take action, but also means that when we do, it'll be really hard to reverse", "label": "1"}
{"id": "1", "text": "Comment:Many of us dont have access to the largest of problem areas, but what can we do to help refocus our communities towards fighting climate change, and what can we do to prepare for the effects?,Reply:Vote (and convince others to vote). National, state, and local elections matter more than anything else on climate. Most of us are powerless to do more than eat less meat and put solar panels on our homes. But if we can get our state to give tax breaks for people to put solar on their homes or get our cities to build sea walls and expand green spaces, we can actually make substantial progress.", "label": "1"}
{"id": "1", "text": "Comment:I am wondering the amount of money the 42 millionth richest person in the world has.,Reply:The paper says the *36* million richest people have assets worth more than one million US dollars.", "label": "1"}
{"id": "1", "text": "Comment:Something isn't right when you have exit polling year after year with discrepancies from the actual tallies and these nutcases who wallow in denier-shit keep getting re-elected. Something is off and we need to look seriously at electoral fraud, not voter fraud.,Reply:That's a direct result of the two party system. Divide people on issues like abortion so you can do all the fucked up stuff you want.", "label": "1"}
{"id": "1", "text": "Comment:does anyone have an explanation why the yearly growth rate fluctuates?,Reply:The CO2 concentration drops during the Northern hemisphere's summer because it has vastly more land, thus vastly more trees budding, growing and absorbing CO2 than the Southern hemisphere does in its summer.", "label": "1"}
{"id": "1", "text": "Comment:Practically, what does this mean? Is it mostly just rhetoric? Do they go to war against polluting countries?,Reply:Honestly we can only speculate at this point. But first and foremost it means that the government publicly acknowledges a crisis and is showing intent to act accordingly. Actual results are pending. But it's a positive trend that now two countries have set this precedent. I hope more countries follow.", "label": "1"}
{"id": "1", "text": "Comment:From an ELI5 perspective, how does an event like this occur, has it happened before and is it something that often happens?,Reply:You may want to consider submitting that question to /r/explainlikeimfive for an in depth answer. I'm sure AGW, warmer oceans, and higher CO^2 levels are all contributing factors. I think the question you're really asking is \"Is this normal?\" The best answer I can give you is \"It is *now*.\"", "label": "1"}
{"id": "1", "text": "Comment:I don't see why this is news. Do we expect it to trend with a negative slope? Isn't it obvious that it will continue rising?,Reply:Because we keep breaking our own record. It's like the Olympics of fucking ourselves over, we keep getting better at it", "label": "1"}
{"id": "1", "text": "Comment:I'm curious to know what changed his mind (as a former climate-skeptic myself).,Reply:I'm kinda curious what the light bulb moment was for you. Do tell?", "label": "1"}
{"id": "1", "text": "Comment:Isn't this exactly what was supposed to happen when they became the world's manufacturing hub?,Reply:In terms of emissions it would have been much better for production to stay in places with stricter pollution controls. Also an enormous amount of shipping emissions would have been prevented.", "label": "1"}
{"id": "1", "text": "Comment:Practically, what does this mean? Is it mostly just rhetoric? Do they go to war against polluting countries?,Reply:Acknowledgement of the magnitude of the carbon problem is a great first step.", "label": "1"}
{"id": "1", "text": "Comment:The only thing Cruz will be president of is the national imbecile society. Policy does not matter - the man is too ugly and freakish to be the POTUS. Face like a bag of door knobs. Merry christmas Ted, you fucking cancer monkey.,Reply:> The only thing Cruz will be president of is the **national imbecile society.** AKA the Republican party?", "label": "1"}