{"id": "1", "text": "Comment:Actions matter.. Do you slap your partner across the face and then say we need to reduce domestic violence ? Reduce your personal footprint to the 2t per annum needed (don't just swap the F150 for a large sedan, ditch it and buy a bike), encourage friends and peers to do, likewise and most importantly, only vote for politicians who will drag freeriders along via legislation. Do that and you know you have done all you can as an individual.,Reply:How is 2 t / year derived? How close are you to that?", "label": "1"}
{"id": "1", "text": "Comment:But back in the day, all politicians agreed that the moon existed and was no Chinese hoax.,Reply:Some people in power are already taking action. Besides, there won't be denying the sudden influx of climate refugees.", "label": "1"}
{"id": "1", "text": "Comment:I did three years ago. It's been hard but worth it,Reply:I'm a sophomore in college trying to decide my major, could you share with me why you think so?", "label": "1"}
{"id": "1", "text": "Comment:Climate has always tried to kill us. We build houses to protect us from deadly weather. We wear clothing and shoes to protect us from multiple environmental factors, ranging from insects to disease. Most of Florida used to be uninhabitable before we drained half the state. About a quarter of all of San Francisco would be underwater were it not for the manmade landfills. Climate is our enemy but we have always adapted. But doing so in the future will require increasingly sophisticated methods for adaptation, which means encouraging economic growth, not restricting it through Green policies.,Reply:I think a lot of people imagine dealing with the 21st-century climate by relying on 19th-century adaptation methods -- a task which understandably seems quite daunting. Not many people in this category bother to educate themselves about how actual climate-adaptation efforts work. Admittedly, it's a very diffuse topic -- the many facets of hydrology, for instance, are tough to get a handle on. I also suspect most people don't know about recent leaps in agricultural technology like the Green Revolution.", "label": "1"}
{"id": "1", "text": "Comment:Only the what?...500th politician to say that? Actions are what matter. I'll cheer on anyone who actually brings change. Talk is cheap as ball hair,Reply:The threshold for legislation in the US is a 60% supermajority in the Senate. That makes it really hard to take action, but also means that when we do, it'll be really hard to reverse", "label": "1"}
{"id": "1", "text": "Comment:Many of us dont have access to the largest of problem areas, but what can we do to help refocus our communities towards fighting climate change, and what can we do to prepare for the effects?,Reply:Vote (and convince others to vote). National, state, and local elections matter more than anything else on climate. Most of us are powerless to do more than eat less meat and put solar panels on our homes. But if we can get our state to give tax breaks for people to put solar on their homes or get our cities to build sea walls and expand green spaces, we can actually make substantial progress.", "label": "1"}
{"id": "1", "text": "Comment:I am wondering the amount of money the 42 millionth richest person in the world has.,Reply:The paper says the *36* million richest people have assets worth more than one million US dollars.", "label": "1"}
{"id": "1", "text": "Comment:Something isn't right when you have exit polling year after year with discrepancies from the actual tallies and these nutcases who wallow in denier-shit keep getting re-elected. Something is off and we need to look seriously at electoral fraud, not voter fraud.,Reply:That's a direct result of the two party system. Divide people on issues like abortion so you can do all the fucked up stuff you want.", "label": "1"}
{"id": "1", "text": "Comment:does anyone have an explanation why the yearly growth rate fluctuates?,Reply:The CO2 concentration drops during the Northern hemisphere's summer because it has vastly more land, thus vastly more trees budding, growing and absorbing CO2 than the Southern hemisphere does in its summer.", "label": "1"}
{"id": "1", "text": "Comment:Practically, what does this mean? Is it mostly just rhetoric? Do they go to war against polluting countries?,Reply:Honestly we can only speculate at this point. But first and foremost it means that the government publicly acknowledges a crisis and is showing intent to act accordingly. Actual results are pending. But it's a positive trend that now two countries have set this precedent. I hope more countries follow.", "label": "1"}
{"id": "1", "text": "Comment:From an ELI5 perspective, how does an event like this occur, has it happened before and is it something that often happens?,Reply:You may want to consider submitting that question to /r/explainlikeimfive for an in depth answer. I'm sure AGW, warmer oceans, and higher CO^2 levels are all contributing factors. I think the question you're really asking is \"Is this normal?\" The best answer I can give you is \"It is *now*.\"", "label": "1"}
{"id": "1", "text": "Comment:I don't see why this is news. Do we expect it to trend with a negative slope? Isn't it obvious that it will continue rising?,Reply:Because we keep breaking our own record. It's like the Olympics of fucking ourselves over, we keep getting better at it", "label": "1"}
{"id": "1", "text": "Comment:I'm curious to know what changed his mind (as a former climate-skeptic myself).,Reply:I'm kinda curious what the light bulb moment was for you. Do tell?", "label": "1"}
{"id": "1", "text": "Comment:Isn't this exactly what was supposed to happen when they became the world's manufacturing hub?,Reply:In terms of emissions it would have been much better for production to stay in places with stricter pollution controls. Also an enormous amount of shipping emissions would have been prevented.", "label": "1"}
{"id": "1", "text": "Comment:Practically, what does this mean? Is it mostly just rhetoric? Do they go to war against polluting countries?,Reply:Acknowledgement of the magnitude of the carbon problem is a great first step.", "label": "1"}
{"id": "1", "text": "Comment:The only thing Cruz will be president of is the national imbecile society. Policy does not matter - the man is too ugly and freakish to be the POTUS. Face like a bag of door knobs. Merry christmas Ted, you fucking cancer monkey.,Reply:> The only thing Cruz will be president of is the **national imbecile society.** AKA the Republican party?", "label": "1"}
{"id": "1", "text": "Comment:Im wondering how much energy is used and how much c02 is produced per 45 searches vs how much carbon the 1 tree removes? Can anyone inform me on this?,Reply:Iirc the search engine it is based on (bing) has solar-powered servers so the engine is technically carbon-negative", "label": "1"}
{"id": "1", "text": "Comment:A circular economy may be one step in the right direction, but degrowth is probably the most effective.,Reply:A central tenet of Circular Economy principles is the decoupling of economic growth and material use.", "label": "1"}
{"id": "1", "text": "Comment:Humanity just might not be up to the job of climate change. Asking it to give up the civilization and lifestyle that fossil fuels afford is like asking bacteria to stop growing at the halfway point on a petri dish.,Reply:Only thing is humanity is the highest evolved kind of life on earth and we should do better than just bacteria... Somehow", "label": "1"}
{"id": "1", "text": "Comment:Literally barely surviving 20 C in Scotland at the moment. No AC here to cool the house down.,Reply:Cool to 20 C ? Or from ? 20 C is too cold , i set the AC to cool to 24-25 C (if its only manage to go way down to 26 C its ok). and #x200B, 104 f (40 c) , is very hot , but it feel worst because of humidity , so the heat index can make it feel much higher (merely 50% humidity gives you 131f 55c)", "label": "1"}
{"id": "1", "text": "Comment:I would donate to plant for the planet! They have already planted around 15 billion trees, and plans to plant a trillion(no typo) trees by 2020. From what I've seen, it's an excellent non profit, but definitely worth some of your own looking into:),Reply:Honest question, is it even physically possible to plant a trillion trees in a year?", "label": "1"}
{"id": "1", "text": "Comment:I'm confused--are they referring to the building? Or to military operations? They repeatedly say \"Pentagon\", but also mention movement of troops and weapons.,Reply:15 seconds of reading ,) \"Using and moving troops and weapons accounted for about 70% of its energy consumption, mostly due to the burning of jet and diesel fuel, Crawford said.\"", "label": "1"}
{"id": "1", "text": "Comment:Water cooling is kind of a problem though. In France some reactors get shut down in the summer because the rivers have become too warm to effectively cool them. They where designed for average water temperatures 20 years ago..,Reply:Could use a ground water loop to pre cool the river water. Ground water stays cold year round", "label": "1"}
{"id": "1", "text": "Comment:Unless Bernie is going to control China and India he can only do so much..,Reply:China and India say literally the same thing about the US, where does the buck stop?", "label": "1"}
{"id": "1", "text": "Comment:Does anyone know of groups doing this using UAS and thermal payloads?,Reply:Methane absorbs in the SWIR. There are various SWIR payloads being used for this, from satellite and aircraft.", "label": "1"}
{"id": "1", "text": "Comment:Did Pruitt \"fundamentally misunderstand\" science, or does he understand these dynamics all too well and is deliberately trying to mislead the public? (Rhetorical...),Reply:There's a nonzero chance a court will decide that at some point...", "label": "1"}
{"id": "1", "text": "Comment:So Trump? How is anyone going to believe him if he changes his stance from \"climate change is a conspiracy created by the chinese\" to \"yeah it's a real issue we need to combat\" ? To me this would clearly be pandering to millennials, who hate being pandered to.,Reply:I would be very intrigued if Trump picked Gibson as VP. Other than them being both from NY it is basically the perfect balance. And Gibson would have some clout talking climate change. I am pretty sure he is just eyeing the governorship though.", "label": "1"}
{"id": "1", "text": "Comment:What can we do to mitigate or stop and (possibly) reverse this?,Reply:Call your representative and tell them to support a carbon tax immediately. A tax of something like $300/ton carbon has been calculated as all it would take to stop global warming. It would upend the economic system as it stands, but there's still some time for a phase-in to happen over a decade or so.", "label": "1"}
{"id": "1", "text": "Comment:Still eating animal products? That extra rewilded land and methane reduction you are selfishly reserving so you can eat food that tastes a little different sure would come in handy.,Reply:This is only part of the solution, number one biggest impact we can have as generic/working individuals is to elect leaders to take action now and pressure other leaders to as well. If you are in the US, register to vote, even if you're not in a swing state and find out what your candidates have to say about climate action!", "label": "1"}
{"id": "1", "text": "Comment:Not all humans can be vegan, we don't all have same blood. If you get your meat from regenerative farms, it can be very environmental friendly, even carbon sequestering. A more valid criticism is if they drive a car everyday. It take a lot of flights. Neither of those are related to human biology and are the highest carbon luxuries. I'm a hardcore environmentalist. I don't own a car and I eat meat occasionally. It's about a balanced carbon footprint.,Reply:Can you show me some study or documentation explaining that not all humans can be vegan? I'd be curious to see this. Interesting", "label": "1"}
{"id": "1", "text": "Comment:Why not implementing a carbon tax for just every products ?,Reply:To me it's like \"Do what I say, Do not what I do.\" We should become much greener, FASTER and show the world how to become sustainable instead of punishing one country. That way, foreigners will see the benefits and hopefully follow us.", "label": "1"}
{"id": "1", "text": "Comment:Blegh! \"Think of the children\" is still exploitative rhetoric. Equating climate denial with child predation is psychologically abusive. People might rightfully revolt against that, hatred on this level will NEVER persuade climate deniers, and it will constrain discourse unduly. Never accuse people of predating on children unless they might've actually done it! Hatred locks the discourse and is the chains of the slave to the status quo! Rhetoric MUST be designed to persuade, NOT to tyrannize.,Reply:One party has ignored CO2 emissions for 3 decades in exchange for cash. I can't conceive of a more immoral act. ISIS has nothing on the GOP - I do not see this as hyperbole.", "label": "1"}