{"id": "0", "text": "Comment:Fuck this. Work at your local level to make your city more enviromentally responsible.,Reply:But this is exactly the conservative viewpoint. Federal government is overreaching, make local people do it. Except local governments do not have the funding, bargaining power, or resources to tackle interstate issues like the environment.", "label": "0"}
{"id": "0", "text": "Comment:If you looked at Climate Change as a disaster movie. It would be the really weird take on Michale Bays Armageddon. Instead of finding out the Earth will be destroyed in a few weeks and making every effort to save humanity. Humans find out over thirty years in advance that the impact will happen and spend most of the movie watching the protagonists trying to warn people about the asteroid while being called liars and accused of orchestrating a hoax. That it. That's us right now.,Reply:The usual problem with disaster movies is that they're only a couple hours long. This means that any kind of disaster looks like a sudden event after which everything is different. While there are examples of climate-related events where you'll see that kind of thing, for the world as a whole, it's not likely to be like that. Instead, you'll see constant, steady change, which just makes things harder over a very long period of time.", "label": "0"}
{"id": "0", "text": "Comment:For those who want kids, maybe consider adoption. You don't need genetics to pass on a legacy.,Reply:It's like go to the shelter instead of the puppy mill/pet store! There is need.", "label": "0"}
{"id": "0", "text": "Comment:Ultimately this is the answer. Grass roots demand for clean renewables will trump whatever bullshit the DC idiots try to promulgate.,Reply:Not sure about that. Due to the problem of the commons in economics legislation is needed so that the cost of pollution is reflected in price. Econ 101. Just saying.", "label": "0"}
{"id": "0", "text": "Comment:I think climate-change deniers already know that climate change is real and it's happening, but they are identifying with the denier mentality because they don't want to take responsibility for it, or because it's the position taken by their political party/team and they don't want to be \"proven\" wrong or have to admit they are wrong. It's a pride/loyalty/spite thing.,Reply:There is a wide variety of reasons to deny climate change. I've met a quite a few who were just not aware of the facts and the science. After a few discussions on how climate science works and exactly specifying what we don't know (admitting that we're not everything really helps in my experience), they were convinced. I think we should be compassionate about the science and not immediately hate on people if they haven't been convinced yet.", "label": "0"}
{"id": "0", "text": "Comment:i've been saying this for years: our climate science students need to be taking debate classes, in addition to their studies on atmo chem, dynamics, rad-tran, etc.,Reply:Debate only works when the other side is interest in honest debate. When the other side lies shamelessly and takes advantage of things like honor and honesty it doesn't work.", "label": "0"}
{"id": "0", "text": "Comment:This letter is completely useless, unless they stuffed a crap ton of cash inside the envelope as well.,Reply:It's not useless. You could let it move you to show it to a friend or parent or friend's parent or teacher or co-worker or neighbor, and tell that person that it's important to you. It's hard and uncomfortable, but not as hard for us as for the authors, who risk defamation and subpoenas and mudslinging and all kinds of retribution.", "label": "0"}
{"id": "0", "text": "Comment:At a glance I read, O-C rides bike to White House on climate change. I thought, good move. More should ride bikes on Capitol Hill. Now it's the bible. Pff.,Reply:I for one am more than ready for us kindhearted liberals to reclaim the Bible, and Jesus for that matter. For one thing, it's defensible as sound theology: You can easily make a good case for Christ as the father of liberalism. Then move on and build upon Pope Francis's June 2015 encyclical on climate change: Laudato Si, On the Care of our Common Home... it effectively reset Catholic dogma to REQUIRE the faithful to be Wise Shepherds of His creation. That's a big fucking deal...", "label": "0"}
{"id": "0", "text": "Comment:Really? Greta the child puppet manipulated and exploited by a higher political agenda, encouraging truancy and sending a generation of children into a frenzy with apocalyptic predictions. Oh please! How many times have we heard about impending doomsday from alarmists like these? If anything her and her handlers should be condemned for their extremist stance and the disruption they've caused to society. Peace prize my a** Don't downvote me, PROVE ME WRONG,Reply:Oh boy... You're damn well right I'm gonna prove you wrong. But I need to source a bunch of articles and some other things. Can't do that on mobile. I'll respond in a bit here.", "label": "0"}
{"id": "0", "text": "Comment:What I find fascinating is that the energy sector understood climate science since the 40s, governments understood it since the late 70s, and everyone understood it since the 90s, yet we still continue to kill our future.,Reply:1970 is when the republicans created the EPA and helped pass the second version of the clean air act. This idea that nothing has been done is false.", "label": "0"}
{"id": "0", "text": "Comment:Please lets look at where the carbon footprint is most heavily generated. Asia. NASA satelites shows repeatedly that carbon is most heavily generated by population density!,Reply:Do you think it matters? When the ice caps melts the water won't be asking which shore contributed the most.", "label": "0"}
{"id": "0", "text": "Comment:There are ~500 gigatons of carbon in the biosphere, and ~3000 gigatons of proved fossil fuel reserves. If we let a forest burn, and then regrow, it also absorbs that carbon back out of the atmosphere.,Reply:But isn't that ~500 sufficient to induce catastrophic global warming, in the end? Isn't the problem the warming itself, and isn't the warming going to happen simply from carbon, not discriminating between fossil fuel carbon or wild-fire carbon? Isn't there enough of that ~500 vulnerable to wild-fires due to the warming we're already experiencing and the warming-to-come, so much of which we can't stop due to 'lag' from effects/conditioned that we've already triggered/created?", "label": "0"}
{"id": "0", "text": "Comment:Who the hell cald him leader of the free world? First of all he doesn't rule the world, not any part of it except for us. And two, he litteraly rules america, could it be less free.,Reply:The president of the US is traditionally called the leader of the free world, since Eisenhower the president of the US has been called that since, you know, they're the most powerful democratic country on earth.", "label": "0"}
{"id": "0", "text": "Comment:In most of the US voting 3rd party in the general election is equivalent to not voting., since the winner is determined by plurality. This is the kind of thing Republican operatives dream up to make it easier for their candidate to win. Don't.,Reply:I'm not talking about a party that takes votes away from the democrats, it doesn't exist to participate in elections necessarily. It is a vanguard party that is essentially serving as a very good way to coordinate organizing. Do you know what I mean? It isn't like the Green Party. Do you know what I mean by vanguard party? People would still be able to vote in the elections for the democrats.", "label": "0"}
{"id": "0", "text": "Comment:It's completely ridiculous that they would fault us for using medication instead of faulting the companies that pollute our air which makes our health and asthma worse. As context, I started getting asthma attack after living in Paris for two years which had massive micro pollution spikes in the summer and even though I have since moved, my asthma reappears during pollution peaks and cold months. So blaming us for using medication to help a disease their pollution inflicted on us is just ludacris.,Reply:Nobody was faulting the asthma sufferers. This is a red herring.", "label": "0"}
{"id": "0", "text": "Comment:Will they put the same amount of effort and time they put to discredit Al gore and cllmate change to create policy actions?,Reply:No because then they'd have to actually stand for something instead of perching in the pretend center preaching to everyone about how bad extremes are.", "label": "0"}
{"id": "0", "text": "Comment:Most of the people care only about performance, wattage doesn't matter to them.,Reply:in the summer I care quite a lot. don't even use the desktop during that season really.", "label": "0"}
{"id": "0", "text": "Comment:\"Have global temperatures ever increased or decreased for prolonged periods? Yes. Fucking yes.\" But never at this speed as the paleo climate record has shown thousands of times already. Stupid Fucking stupid.,Reply:it doesnt matter how fast we get there, just accept its normal that it comes. there are way way bigger issues facing both civilisation and the earth. i remember back before climate debate arose, environmentalism was something everyone could get onboard with. And with your *stupid fucking stupid* comment we see a fine example of how the issue has added another layer to religion, sex, politics, class etc in segregating the peoples.", "label": "0"}
{"id": "0", "text": "Comment:Don't know why people are so eager to dive into an ice age...yes warming will make it tough on coastal populations (as it always has, ask the residents of Doggerland) but an ice age would be catastrophic on a whole different level...,Reply:If you really think we're at risk for an ice age when every new year is setting records for high temperatures and low amounts of ice, while glaciers high in the mountains melt, you were clearly raised in a lead paint factory.", "label": "0"}
{"id": "0", "text": "Comment:Yes, let's completely ignore the costs associated with desertification of the land that was used for grazing and turned to planted crops. I'm getting a bit tired of all this \"veganism can save the planet\" which is always based on short-term benefits but completely neglects long-term costs.,Reply:You sound like you have no idea what you're talking about. What do you mean by desertification? Are you trying to bring up how nutrients get used up and leave soil \"barren\"? You know you can do things to get nutrients back in the soil, things like planting nitrogen fixing crops.", "label": "0"}
{"id": "0", "text": "Comment:It is my opinion that such headlines should detail the actual cost (like stories about unemployment, national debt). Show the numbers: \"a second trump term would cost $xx billion in lost costal real estate, put US economy decades behind China on carbon neutral tech\" The wallet is where conservative voters have feelings.,Reply:You want a cost? How about all of human life? They're pro-life, they should care about that.", "label": "0"}
{"id": "0", "text": "Comment:In general, the major constraint on the adoption of new technology in solar has been price per watt, not how efficiently it turns light into energy. Stuff like this matters for aerospace applications where, watts/kg is much more important.,Reply:\"Yes, but\" means \"no.\" Yes, but most of the cost of a solar system (in the US, at least) is \"balance of plant\" - the racking, the inverters, the labor, etc. The cost of the panels is something like 30% of the cost of a utility-scale system. So a 20% more efficient solar cell cuts the price of the WHOLE system by 20%, and can be worth a disproportionate amount as a result. (bifacial solar is an example of people doing this right now.)", "label": "0"}
{"id": "0", "text": "Comment:Lol you're barking up the wrong tree here, fifa don't care about anyone or anything. Most corrupt body out there.,Reply:Making a move like this might be a great way for them to improve their highly damaged reputation though. Although it would be quite controvertial.", "label": "0"}
{"id": "0", "text": "Comment:Talk is cheap as they say. It's time to hit Brazil and other offending countries hard with effective sanctions to make them head these warnings. The biggest offenders must act quickly and in tandem for any real change to occur. But how do we take action on this?,Reply:How can the United States, the second worst polluter, sanction anyone for ecological damage in good faith? We need to stop our own bullshit first before we start looking at other nations.", "label": "0"}
{"id": "0", "text": "Comment:I hate he fact that anti-capitalists are riding the climate change problem to further their agenda. Now we have cowardly capitalists ignoring climate change by hiding their head in the sand with lies like \"CO2 is plant food\" and cowardly socialist ignoring climate change with lies like \"if we solve capitalism climate change is solved\". They are both equally evil because both will bring about the demise of our civilization with their useless, self serving politics.,Reply:In no part of this article do I make the claim that abolishing Capitalism would resolve the issues that are discussed in the article, and I make a direct statement that Capitalism does not bare the sole responsibility for the issue. The article was not written to further any agenda, but simply to inform people of the role of Capitalism in providing an incentive for bad practices within, and the external manipulation of, scientific research.", "label": "0"}
{"id": "0", "text": "Comment:This is hardcore. Despite the statement they are trying to make, they would choke to death even in a regular temperate climate.,Reply:not at all. the ropes are too long, the noises too loose. each one of them could step off their perch without a problem. softcore at best.", "label": "0"}
{"id": "0", "text": "Comment:I thought everyone was entitled to legal support and representation? This stance doesn't seem appropriate, legally.,Reply:They already have decades of elite legal support and representation. They dont need new ones.", "label": "0"}
{"id": "0", "text": "Comment:Well, what they demand is what a lot of scientists demand. As soon and as fast as possible. Sitting on your bum and not doing anything for 30 years isn't a good sign...,Reply:That's not what they demand. They demand net zero by 2025, and a lot of scientists state that while its a noble goal - it's not only not possible, but it could lead to a lot of suffering that could be avoided.", "label": "0"}
{"id": "0", "text": "Comment:They certainly have tremendous weight in DC with their puppet GOP clowns but right now it's more about simple economics. Strictly speaking from the economic side, with oil <$40 per barrel alternative energy doesn't make any sense.,Reply:> Strictly speaking from the economic side, with oil <$40 per barrel alternative energy doesn't make any sense. Strictly speaking, you don't know what you're fucking talking about.", "label": "0"}
{"id": "0", "text": "Comment:That is cool but this one is barely active, seems kind of bad to split the community.,Reply:I'm not sure what you mean. The subs are brand new. That's why they're barely active. Also, I don't understand your point about splitting \"the community\". What community are you referring to? These subs are available to different people for different information.", "label": "0"}
{"id": "0", "text": "Comment:Who ever thought burning biomass could be classified as carbon neutral was a bit short sighted...,Reply:Technically, if the biomass comes from a sustainable harvesting then it would be carbon neutral (in the sense low carbon, there is nothing truly carbon neutral). The problem is the scale, as usual. We simply cannot replace the fossil fuels with biomass because the Earth is too small. Biomass is just low efficiency solar whose strength is that it does not require mineral extraction or a complex industrial ecosystem. There is a logical reason why we switched from biomass and renewables to fossil fuel ~200 years ago.", "label": "0"}
{"id": "0", "text": "Comment:Bill idiot Nye isn't exactly who he says he is. He's not even a scientist,Reply:I hear this argument a lot, what constitutes a scientist? This individual was a Boeing engineer. You don't get that way without cracking open a science book.", "label": "0"}
{"id": "0", "text": "Comment:So we should censor people based on how correct their speech is? That's a very slippery slope...,Reply:Addressing misinformation is not censorship, nor should censorship be used to address misinformation. Boycotting outlets that spread misinformation is a valid tactic for addressing misinformation.", "label": "0"}
{"id": "0", "text": "Comment:We are entering a period of massive depopulation in the next 20-70 years that is already baked in due to demographic change. We're talking a halving of the global population by 2150. 1/2 countries in the world have sub-replacement rate fertility and nearly 10 will halve by 2100.,Reply:This is not true, how is it baked in? People are being born faster than people are dying and that won't change anytime soon", "label": "0"}
{"id": "0", "text": "Comment:I have mixed feelings about this. I mean, it's nice when you see kids trying to effect change for good. But at the same time, do you think they fully understand the issue? I worry that kids in this type of situation are just being manipulated by adults, to push their activism, whether you think the goal is correct or not.,Reply:I walked out to protest once with my classmates when I was young. Adults had nothing to do with it. Nobody's manipulating these kids. Might be hard for you to believe children have agency but it's true. As for understand the issues... We teach children about seasons in 2nd grade. We teach them about light, dark, absorption and reflection in 4th to 6th. Gasses are a little complex, but if a 6th to 8th grade science class teaches light emission (argon and neon tubes) and dispersion then that's pretty much all the basic functional parts of our global system.", "label": "0"}
{"id": "0", "text": "Comment:Anyone else here reached the conclusion that it no longer matters what the US and Saudis do because we are well-along in a process of irreversible collapse? Or, maybe it's just me.,Reply:No, there's a lot of others who believe the Earth is boned regardless. I'm not one of them, and I think we should still fight onwards anyways.", "label": "0"}
{"id": "0", "text": "Comment:Can we do something about spam mail? It could probably shorten the time that USPS workers are out delivering.,Reply:Impossible. The USPS makes a ton of money via mailing advertisements. I haven't checked, but I would not be so surprised to find that they make MOST of their money this way.", "label": "0"}
{"id": "0", "text": "Comment:Reddit has such a boner for nuclear and carbon capture because everyone on here loves new tech. Sad thing is they are depending technology that's not even viable.,Reply:Tf is this comment? Nuclear is the safest and most efficient form of green energy. That's why reddit loves it. It's been around for ages and only a few plants produce tons of energy. Of the (only) 449 reactors globally, they produce well over twice what the US's entire wind and solar grid produces.", "label": "0"}
{"id": "0", "text": "Comment:It doesn't matter if it's propaganda or not if it's true. Do you think the daffodils blooming in December are trying to *fool* you into thinking it might really be exceptionally warm? Sly old daffs, eh?,Reply:It *does* matter. Like with faux-News: mentioning climate change only when its cold and ommitting it when its hot leaves a lopsided picture for the audience.", "label": "0"}
{"id": "0", "text": "Comment:How about the go clean beaches or plant trees instead ?,Reply:Litter isn't what's going to cause famine and natural disasters. It's CO2 emissions.", "label": "0"}
{"id": "0", "text": "Comment:ANY of the Democratic field would get us years ahead of China. Trump is trying to take up back to the 19th century.,Reply:Nope. Both GOP and Dems are beholden to the companies that are causing lot of the damage. T", "label": "0"}
{"id": "0", "text": "Comment:work out and say affirmations everyday, its not about climate change its about you,Reply:Bullshit, climate depression is not a personal problem. You are emotionally mature and brave to face our dire situation. It's not a chemical imbalance. Join the Sunrise Movement or Extinction Rebellion.", "label": "0"}
{"id": "0", "text": "Comment:Blaming Trump for the environmental situation is fucking ridiculous. Yeah he'll make things worse, but this has been decades in the making. I wonder, how many people complaining about Trump still eat meat, fly on planes, and buy mountains of plastic crap every year?,Reply:Nope, we get to blame trump for everything just like they blamed obama for everything. It comes with the job.", "label": "0"}
{"id": "0", "text": "Comment:Thank god enough money wasted on this bullshit. We have homeless veterans in this country,Reply:Not doing anything about climate change will without doubt increase the chance of war and more veterans for the US when they send peacekeeping troops to war torn countries. You don't think at all.", "label": "0"}
{"id": "0", "text": "Comment:The majority in charge of each branch of the Federal Government believe it is either a hoax or a non-issue because God wills it. Welcome to the next 40 years. On the upside: the Obama years will officially be \"The Good Old Days\".,Reply:In the last 20 years we've established a pretty strong pattern of 2 term presidents with opposition in congress. I wouldn't count on the GOP keeping power for that long without opposition.", "label": "0"}
{"id": "0", "text": "Comment:What mostly is misunderstood, is that the worst isn't the energy that is used, but the refrigerants being released when AC's are deposited wrongly. They are a 2000 more potent greenhouse gas than CO2.,Reply:Minor quibble: in some places with a fossil-fuel heavy grid, it's also the energy usage. But that's not the long-term issue.", "label": "0"}
{"id": "0", "text": "Comment:The fact is that the mantra of *economic growth* is seen as the passport to government in a democracy (*it's the economy, stupid!*). No one will get into power telling the voters that we must live on less, that everything fossil-fuels should be prohibitively expensive, that you cannot travel by air anymore, that you must accept more uncertainty, that you must accept less overall security. Democracy is the obstacle to any meaningful action on climate change.,Reply:No, the obstacle isn't democracy, but capitalism. China is no democracy, but it's the first polluter, and still building coal stations to worship the great god of growth. Any economic doctrine predicating growth at all costs is doomed to clash with the limits of a finite world.", "label": "0"}
{"id": "0", "text": "Comment:Because fossil fuel and nuke lobbyists own our government. Fossil Fuel and nuke energy are the past Renewables are the future.,Reply:Nuclear energy is not contributing to climate change. If nuclear lobbies owned \"our\" (the US?) Government, then presumably the US would have built a new one sometime in the last twenty years.", "label": "0"}
{"id": "0", "text": "Comment:Surely if new roads where congestion is an issue aren't built, then traffic will remain congested, increasing the amount of pollution they emit... What am I missing here?,Reply:Building new roads doesn't relieve congestion due to induced demand. Known since the founding of the freeway system. You keep the roads the same and put higher capacity vehicles like buses down them or add transit to fixed road capacity.", "label": "0"}
{"id": "0", "text": "Comment:The South ran from a battle with regard to the economic impact getting rid of slavery would have on some of their slave owning citizens. This time, unfortunately, the country is united for fear of their pocketbooks.,Reply:Now hang on a sec, linguistically that just really bothers me. You can't stretch the phrase \"ran from a battle\" so far as to suggest that the South metaphorically ran from a battle by *literally starting a war that they had very little hope of winning*. I mean it's almost exactly the opposite of running from a battle. They literally ran towards a battle. They actually started it by bombing fort sumter.", "label": "0"}
